server/app/controllers/audio_controller.rb

SELECT  "shares".* FROM "shares" WHERE "shares"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "mains".* FROM "mains" WHERE "mains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def info_share
        @share_audio = Share.find(params[:share_id])
        @main_audio = Main.find(@share_audio.main_id)

SELECT  "mains".* FROM "mains" WHERE "mains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def info_list
        @main_audio = Main.find(params[:audio_id])

INSERT INTO "shares" ("main_id", "start_time", "end_time", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["main_id", 1], ["start_time", 10.0], ["end_time", 50.0], ["content", "ㄴ말하는대"], ["created_at", "2017-11-23 19:10:42.756692"], ["updated_at", "2017-11-23 19:10:42.756692"]]
SELECT  "mains".* FROM "mains" WHERE "mains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "mains" SET "count" = ?, "updated_at" = ? WHERE "mains"."id" = ?  [["count", 1], ["updated_at", "2017-11-23 19:10:42.764159"], ["id", 1]]
---
    def share
	    share_audio = Share.new
	    share_audio.main_id = params[:id]
	    share_audio.content = params[:content]
	    share_audio.start_time = params[:startTime]
	    share_audio.end_time = params[:endTime]
	    share_audio.save
	    add = Main.find(params[:id])
	    add.count = add.count + 1
	    add.save

SELECT "mains".* FROM "mains"
---
    def list
    	all_audio = Main.all